###############################################################################
# Copyright (c) 2011 neXtep Software and contributors.
# All rights reserved.
#
# This file is part of neXtep designer.
#
# NeXtep designer is free software: you can redistribute it 
# and/or modify it under the terms of the GNU General Public 
# License as published by the Free Software Foundation, either 
# version 3 of the License, or any later version.
#
# NeXtep designer is distributed in the hope that it will be 
# useful, but WITHOUT ANY WARRANTY; without even the implied
# warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  
# See the GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Foobar.  If not, see <http://www.gnu.org/licenses/>.
#
# Contributors:
#     neXtep Softwares - initial API and implementation
###############################################################################
mergeCheckOutError=Un merge n'est possible que sur des \u00E9l\u00E9ments checkin\u00E9s. Il s'agit d'une mesure de pr\u00E9caution pour garantir le retour arri\u00E8re du merge et pour isoler l'activit\u00E9 de merge de votre d\u00E9veloppement.
version.commit.externalCheckoutElement=\ - {0} {1}: check-out par {2}\n

version.history.release=Version
version.history.branch=Branche
version.history.status=Statut
version.history.created=Cr\u00E9\u00E9 le
version.history.by=Par
version.history.activity=Activit\u00E9

version.ui.checkOutJob=Check-out des \u00E9l\u00E9ments
version.ui.commitJob=Commit des \u00E9l\u00E9ments
version.ui.pickPrevious=S\u00E9lectionnez une version pr\u00E9c\u00E9dente
version.ui.undoCheckOutJob=Annulation du check-out des \u00E9l\u00E9ments
versionable.status.activity=Activit\u00E9
versionable.status.branch=Branche
versionable.status.createdBy=Par
versionable.status.createdOn=Cr\u00E9\u00E9e le
versionable.status.name=Nom
versionable.status.release=Version
versioningService.ui.commitCancelled=L'utilisateur a annulé le commit
versioningService.ui.unsynchronizedWorkspace=Op\u00E9ration annul\u00E9e : la vue est d\u00E9synchronis\u00E9e.
view.connectionWizard.description=D\u00E9finissez une connexion vers la base de donn\u00E9es \u00E0 partir de laquelle votre espace de travail sera initialis\u00E9.
viewCreationEmpty=L'assistant va cr\u00E9er une vue vide sans aucun \u00E9l\u00E9ment ni connexion de base de donn\u00E9es initiale
viewCreationImport=L'assistant vous demandera de d\u00E9finir une connexion \u00E0 une base de donn\u00E9es qui sera utilis\u00E9e pour importer la structure de cette base dans la vue. Les \u00E9l\u00E9ments import\u00E9s seront ajout\u00E9s comme \u00E9l\u00E9ments initiaux non versionn\u00E9es dans la nouvelle vue.
viewCreationRules=L'assistant va vous demander de d\u00E9finir un lot de r\u00E8gles qui seront appliqu\u00E9es pour d\u00E9finir le contenu initial de la vue. Typiquement, une r\u00E8gle est un container dans une version donn\u00E9e.
viewCreationDelivery=L'assistant va vous demander de choisir une livraison existante \u00E0 partir de laquelle la vue sera initialis\u00E9e. La vue contiendra alors l'ensemble des composants livr\u00E9s.
user.editor.comments=Commentaires : 
user.editor.login=Login : 
user.editor.password=Mot de passe : 
user.editor.passwordConfirm=Confirmation du mot de passe : 
user.editor.rights=Droits (pour utilisation future) : 
user.editor.username=Nom de l'utilisateur : 
user.login.authenticating=Authentification...
user.login.authentication=Authentification
user.login.authenticationFailed=L'authentification a \u00E9chou\u00E9 \!
user.login.authenticationFailed.2=L'authentification a \u00E9chou\u00E9 : 
user.login.authenticationJob=Authentification de l'utilisateur du r\u00E9f\u00E9rentiel
user.login.configurationError=Erreur de configuration du r\u00E9f\u00E9rentiel
user.login.connectButton=Connexion...
user.login.connected=Connect\u00E9.
user.login.connecting=Connexion en cours, veuillez patienter...
user.login.connectionAttempt=Tentative de connexion vers {0}...
user.login.connectionFailed=Impossible de se connecter : 
user.login.initializingConnection=Initialisation de la connexion...
user.login.login=Login : 
user.login.noRepository=Aucune connexion au r\u00E9f\u00E9rentiel.
user.login.password=Mot de passe : 
user.login.quitButton=Quitter
user.login.repositoryConnection=Connexion au r\u00E9f\u00E9rentiel [{0}]...
user.login.repositoryEdition=Editer la connexion au r\u00E9f\u00E9rentiel...
user.login.success=Succ\u00E8s\! L''utilisateur {0} est logu\u00E9.   
userNeedAdminRights=Vous devez disposez des droits d'administration pour acc\u00E9der \u00E0 la console de gestion des utilisateurs. L'utilisateur 'SYSTEM' dispose de ces droits initialement.
userPasswordEmptyError=Un mot de passe utilisateur ne peut \u00EAtre nul ou vide.
userLoginEmptyError=Un login utilisateur ne peut \u00EAtre nul ou vide.
userConfirmChangePassword=Vous vous appr\u00EAtez \u00E0 changer le mot de passe de l''utilisateur {0} en {1}. Cette op\u00E9ration est irr\u00E9versible. \u00CAtes-vous s\u00FBr de changer ce mot de passe ?
confirmRemoveVersionable=\u00CAtes-vous s\u00FBr de vouloir supprimer les \u00E9l\u00E9ments suivants de leur module parent ?\n{0}
confirmRemoveVersionableTitle=Confirmation de suppression
confirmRemoveVersionableForce=Forcer la suppression de cet objet ne v\u00E9rifiera pas les d\u00E9pendances et peut cr\u00E9er des r\u00E9f\u00E9rences externes. Ne l''utilisez que lorsque la suppression classique ne fonctionne pas. \u00CAtes vous s\u00FBr de vouloir FORCER la suppression des \u00E9l\u00E9ments suivants de leur module parent ?\n{0}
confirmRemoveVersionableTitleForce=Removal confirmation
openingNewView=Ouverture de la vue...
unresolvedWouldAppear=Cette action engendrerait des r\u00E9f\u00E9rences externes. Veuillez commencer par int\u00E9grer les \u00E9l\u00E9ments d\u00E9pendants. D\u00E9pendance trouv\u00E9e de {0} {1} vers {2} {3}.
viewRulesWizardMessage=D\u00E9finissez la structure de cette vue en organisant son contenu \u00E0 partir des versions de modules existants.
viewRulesWizardFilter=Filtrer les modules du r\u00E9f\u00E9rentiel :  
viewRulesWizardViewContents=Contenu de la vue courante :  
viewRulesWizardAdd=Ajouter le module \u00E0 la vue >>
viewRulesWizardRemove=<< Supprimer le module de la vue
viewRulesWizardRemoveContainer=Suppression du module de la vue...
checkInContainerExistingCheckoutsTitle=Ce module contient des check-out
checkInContainerExistingCheckoutsMsg=Le module que vous tentez de commiter contient des \u00E9l\u00E9ments non-commit\u00E9s.\n\nVous ne pouvez commiter un module que lorsque l'ensemble de son contenu est lui-m\u00EAme commit\u00E9. Un dialogue va maintenant s'ouvrir pour vous proposer de commiter ou de d\u00E9faire les changements des sous-\u00E9l\u00E9ments de ce module, ou d'annuler l'op\u00E9ration.\n\nSi tous les \u00E9l\u00E9ments ne sont pas valid\u00E9s apr\u00E8s le dialogue, le commit de ce module \u00E9chouera.
checkInContainerExistingCheckoutsNotPrompt=Ne plus afficher ce message
checkInDifferentUserForceTitle=Des versions sont maintenues par d'autres utilisateurs
checkInDifferentUserForce=Toutes les versions \u00E0 commiter ne vous appartiennent pas. Vous devriez demander aux personnes respectives de commiter les versions suivantes :\n{0}Voulez-vous malgr\u00E9 tout forcer le commit de ces \u00E9l\u00E9ments ?
checkInDifferentUserCancel=Le commit a \u00E9t\u00E9 annul\u00E9 car certaines versions sont g\u00E9r\u00E9es par d'autres personnes.
delViewConfirm=Vous ne pourrez pas annuler cette action.\n\u00CAtes vous s\u00FBr de vouloir supprimer la vue {0} ?
delViewConfirmTitle=Supprimer la vue {0} ?
delViewWithCheckoutsConfirm=La vue \u00E0 supprimer poss\u00E8de des modifications non commit\u00E9es, vous ne serez pas en mesure de retrouver ces modifications si vous poursuivez la suppression. Nous vous conseillons de commiter / d\u00E9faire ces modifications avant de supprimer cette vue.\nVoulez-vous tout de m\u00EAme supprimer cette vue ?
delViewWithCheckoutsConfirmTitle=La vue \u00E0 supprimer poss\u00E8de des checkouts
reloadViewPrompt=La vue de cet espace de travail a \u00E9t\u00E9 mise \u00E0 jour, vous devez recharger la vue pour effectuer des op\u00E9rations de versioning.\nVoulez-vous recharger la vue maintenant ?
reloadViewPromptTitle=Vue courante d\u00E9synchronis\u00E9e 
reloadViewSwitch=Remplacement des r\u00E9f\u00E9rences vers la nouvelle vue...
reloadViewSwitchEditors=Notification aux \u00E9diteurs ouverts...
commitContainerWizardTitle=Assistant de commit d'une version de container...
commitContainerWizardHelp=Ajustez le num\u00E9ro de version du module \u00E0 commiter.\nCette version ne sera plus modifiable apr\u00E8s cette op\u00E9ration et tous les sous-\u00E9l\u00E9ments de ce module seront automatiquement commit\u00E9s.
commitContainerCheckoutsIntro=El\u00E9ments \u00E0 commiter :
action.checkout.tooltip=Créer une nouvelle version modifiable (checkout)
action.commit.tooltip=Valider cette version et verrouiller les modifications (commit)
action.undoCheckout.tooltip=Annuler la version courante et revenir en arrière sur les changements
addOnVolatileError=Vous ne pouvez modifier que les \u00E9l\u00E9ments du repository. La s\u00E9lection courante semble \u00EAtre volatile et vous ne pouvez donc pas la modifier.
resolveImportTooltip=R\u00E9soudre les d\u00E9pendances lors de l'import des objets de la base de donn\u00E9es
resolveImportWarning=La d\u00E9sactivation de la r\u00E9solution de d\u00E9pendances peut cr\u00E9er des probl\u00E8mes dans la nouvelle vue. Ne d\u00E9sactivez cette option que si le mode standard ne fonctionne pas (d\u00E9pendances circulaires).\n\u00CAtes-vous s\u00FBr(e) de vouloir d\u00E9sactiver la r\u00E9solution de d\u00E9pendances ?
resolveImportWarningTitle=D\u00E9sactiver la r\u00E9solution de d\u00E9pendances ?
movingVersionableConfirm=\u00CAtes-vous s\u00FBr de vouloir d\u00E9placer tous les \u00E9l\u00E9ments s\u00E9lectionn\u00E9s vers le module {0} ?
movingVersionableConfirmTitle=Veuillez confirmer le d\u00E9placement
controller.versionable.newBranch=Cr\u00E9ation d'une nouvelle branche...
controller.versionable.newVersionableError=Tentative d'instanciation de IVersionable directement à partir du controlleur
undoCheckoutInvalidUser=Le {0} {1} est maintenu(e) par {2}. Veuillez lui demander de d\u00E9faire lui(elle)-m\u00EAme ce checkout.
removeCheckedOutContainerNotAllowed=Vous ne pouvez pas supprimer un conteneur non versionn\u00E9 ou en check-out. Veuillez d'abord d\u00E9faire le check-out.
removeCheckedOutContainerNotAllowedTitle=Seuls les modules commit\u00E9s peuvent \u00EAtre supprim\u00E9s
removeVersionableCommand=Suppression de {0} {1} du module {2}...
removeVersionableProgress=Suppression des \u00E9l\u00E9ments...
repositoryFileLargeWarn=Vous \u00EAtes sur le point d''ouvrir un fichier de {0} Kb et l''int\u00E9gralit\u00E9 du fichier doit \u00EAtre charg\u00E9e en m\u00E9moire. Veuillez v\u00E9rifier que vous disposer de suffisamment de m\u00E9moire dans votre JVM avant de continuer sinon vous risquer de voir des exceptions de type OutOfMemory apparaître.\n\u00CAtes-vous s\u00FBr de vouloir ouvrir ce fichier ?
moveToContainerSelection=S\u00E9lectionnez le module où d\u00E9placer la s\u00E9lection
moveToContainerLockedTitle=Module verrouill\u00E9, check-outer maintenant ?
moveToContainerLocked=Le module que vous avez s\u00E9lectionn\u00E9 n'est pas modifiable, voulez-vous effectuer le checkout maintenant ?\nSi vous r\u00E9pondez non, le d\u00E9placement sera annul\u00E9.
moveToContainerSourceLocked=La s\u00E9lection contient des objets situ\u00E9s dans un module commit\u00E9 (et donc non modifiable). Veuillez vous assurez que tous les \u00E9l\u00E9ments s\u00E9lectionn\u00E9s soient situ\u00E9s dans des modules modifiables puis r\u00E9essayez.
moveToContainerSourceLockedTitle=Les \u00E9l\u00E9ments s\u00E9lectionn\u00E9s ne sont pas d\u00E9plaçables

comparison.additionNode=El\u00E9ments \u00E0 ajouter
comparison.updateNode=El\u00E9ments \u00E0 alt\u00E9rer
comparison.removalNode=El\u00E9ments \u00E0 dropper
comparison.view.colObjectName=El\u00E9ment source
comparison.view.colDiffType=Diff
comparison.view.colTargetName=El\u00E9ment cible
comparison.view.unableToShow=Impossible d'afficher la vue de comparaison, le workbench ne semble pas pr\u00EAt.
comparison.version=version {0}
comparison.view.showViewError=Un probl\u00E8me est survenu lors de la tentative d'ouverture de la vue de comparaison. Veuillez v\u00E9rifier votre installation.
comparison.jobTitle=Comparaison des versions...
comparison.jobTask=Comparaison de {0} versions {1} <-> {2}...

comparisonProvider.label.editor=Comparaison c\u00F4te \u00E0 c\u00F4te \u00E9diteur natif
comparisonProvider.label.properties=Comparaison de propri\u00E9t\u00E9s

comparison.openComparisonError=Impossible d'ouvrir l'\u00E9diteur de comparaison

unchangedNode=El\u00E9ments inchang\u00E9s
mergeUnresolved=Des \u00E9l\u00E9ments en conflit emp\u00EAche le merge de s'accomplir. Voulez-vous voir la fen\u00EAtre de merge une nouvelle fois pour corriger ce probl\u00E8me ?
mergeUnresolvedTitle=Ce merge contient des conflits
namePatternsPrefPageDesc=Permet de d\u00E9finir les r\u00E8gles de nommage des nouveaux \u00E9l\u00E9ments cr\u00E9\u00E9s dans le repository
namePatternsPrefPageVars=La liste suivante indique les variables applicables et leur signification :
namePatternsPrefPagePatterns=Ajoutez / \u00E9ditez les r\u00E8gles de nommages ici :
mergeDidNothing=Aucun merge n'est n\u00E9cessaire puisque aucune diff\u00E9rence n'a \u00E9t\u00E9 identifi\u00E9e. Voulez-vous cr\u00E9er une nouvelle version (ne contenant aucune modification) qui repr\u00E9sentera votre action de merge ?
mergeDidNothingTitle=Aucune modification \u00E0 merger
userCreationWizardPage=Gestion des utilisateurs du r\u00E9f\u00E9rentiel
userCreationWizardPageDesc=Ajoutez ou modifiez les utilisateurs pouvant se connecter au r\u00E9f\u00E9rentiel.\nIl doit y avoir au moins un utilisateur d\u00E9fini en plus de l'utilisateur syst\u00E8me.
userAdd=Ajouter
userEdit=Editer
userDisable=D\u00E9sactiver
userEditorWizardTitle=Assistant d'\u00E9dition d'un utilisateur
userEditorWizardDesc=D\u00E9finissez les propri\u00E9t\u00E9s de cet utilisateur et accordez lui des drois sur le\nr\u00E9f\u00E9rentiel . 
userNotCreatedError=Veuillez cr\u00E9er au moins un utilisateur dans le r\u00E9f\u00E9rentiel.
repositoryUpgradeTitle=Configuration de la base de donn\u00E9es du r\u00E9f\u00E9rentiel
repositoryUpgradeDesc=Cette section vous permet d'installer ou de mettre \u00E0 jour la base de donn\u00E9es du r\u00E9f\u00E9rentiel\nde versioning.
noRepositoryMsgBold=\nAucun r\u00E9f\u00E9rentiel n'a \u00E9t\u00E9 trouv\u00E9!\n
noRepositoryConnectionMsgBold=\nAucune connexion vers un r\u00E9f\u00E9rentiel neXtep n'a \u00E9t\u00E9 d\u00E9finie ou la connexion n'est pas valide.\n
tooOldRepositoryMsgBold=\nLa version du r\u00E9f\u00E9rentiel est trop ancienne et doit \u00EAtre mise \u00E0 jour\n
table.viewSelector.delCol=Suppr
table.viewSelector.descCol=Description
table.viewSelector.vendorCol=Vendeur
table.viewSelector.workspaceCol=Espace de travail
repositoryMsg=Cet assistant va maintenant installer/mettre \u00E0 jour la base de donn\u00E9es que vous avez indiqu\u00E9e. Cliquez sur cancel pour annuler l'op\u00E9ration.
repositoryConnectionMsg=Cet assistant va maintenant vous proposer de configurer une connexion vers une base de donn\u00E9es contenant un r\u00E9f\u00E9rentiel neXtep existant ou vers une base de donn\u00E9es vide pour installer un nouveau r\u00E9f\u00E9rentiel. 
newViewWizardDesc=Cet assistant vous permet de cr\u00E9er un nouvel espace de travail (workspace) de contenu versionn\u00E9. D\u00E9finissez ses\nattributs et choisissez un mode de cr\u00E9ation qui vous permettra de d\u00E9finir le contenu initial du workspace.
newViewWizardCreationType=S\u00E9lectionnez le mode de cr\u00E9ation du workspace :
newViewWizardCreationTypeEmpty=Cr\u00E9er un nouvel espace de travail vide
newViewWizardCreationTypeReverse=Importer la structure d'une base de donn\u00E9es existante (reverse engineering)
newViewWizardCreationTypeDelivery=Recr\u00E9er un workspace \u00E0 partir d'un livrable neXtep
newViewWizardCreationTypeRules=D\u00E9finir explicitement les versions des modules \u00E0 inclure
newViewWizardCreationTypeReverseDefault=Tout importer dans un seul module par d\u00E9faut

handler.copy.invalidMsg=Les \u00E9l\u00E9ments source et cible de cette copie ne peuvent avoir le même nom
handler.copy.invalidTitle=Nom invalide
handler.copy.title=Nom de la copie
handler.remove.confirmMsg=Vous êtes sur le point de supprimer {0} élément(s) de votre espace de travail. Vous ne pourrez annuler cette opération que via un undo-checkout sur le module parent.\nÊtes-vous sûr de vouloir poursuivre ?
handler.remove.title=Confirmation de suppression
handler.rename.dialogTitle=Renommage
handler.rename.invalidMsg=Cet \u00E9l\u00E9ment ne peut avoir un nom vide, l'op\u00E9ration de renommage a \u00E9t\u00E9 annul\u00E9e.
handler.rename.invalidTitle=Nom invalide
helper.connection.noTarget=Aucune connexion trouv\u00E9e pour cette cible
helper.connection.saveFail=Impossible de sauvegarder les informations de connexion
helper.connection.undefined=Aucune d\u00E9finition de connexion n'a \u00E9t\u00E9 trouv\u00E9e.
helper.encryption.failure=Impossible de crypter le mot de passe.
linker.connections=Chargement des connexions utilisateur...
navigator.targetSet.title=Connexions locales

dialog.confirmCommit.adjutRelease=Ajuster la version
dialog.confirmCommit.message=Les \u00E9l\u00E9ments suivants vont \u00EAtre commit\u00E9s dans le r\u00E9f\u00E9rentiel
dialog.confirmCommit.title=Confirmation de commit des \u00E9l\u00E9ments
dialog.confirmUndo.message=Vous ne pourrez pas annuler cette action, tous changements effectu\u00E9s sur les versions s\u00E9lectionn\u00E9es seront perdus.\n\u00CAtes vous sur de vouloir annuler le(s) checkout(s) en cours des \u00E9l\u00E9ments suivants :
dialog.findElement.defaultTitle=Ouvrir l'\u00E9l\u00E9ment...
dialog.findElement.filterLabel=Entrez le nom de l'\u00E9l\u00E9ment \u00E0 filtrer :
dialog.findElement.matchingLabel=El\u00E9ments trouv\u00E9s :
dialog.version.history=Historique des versions
dialog.versionSettings.activity=Activit\u00E9 : 
dialog.versionSettings.adjustReleaseTask=Ajustement des versions...
dialog.versionSettings.alignReleaseTask=Alignement des versions contenues
dialog.versionSettings.checkoutLookupTask=R\u00E9cup\u00E9ration des checkout fils
dialog.versionSettings.description=Ce dialogue vous permet d'ajuster les propri\u00E9t\u00E9s des versions list\u00E9es ou d'annuler l'op\u00E9ration en cours.
dialog.versionSettings.title=Validation des propri\u00E9t\u00E9s de la version
dialog.versionSettings.workbenchNotificationTask=Notification vers l'espace de travail
dialog.viewSelector.cancel=Annuler
dialog.viewSelector.connected=Connect\u00E9.
dialog.viewSelector.connectionAttempt=Tentative de connexion \u00E0 {0}...
dialog.viewSelector.connectionInit=Initialisation de la connection...
dialog.viewSelector.createWorkspaceButton=Cr\u00E9er un nouveau workspace...
dialog.viewSelector.failure=Echec\! 
dialog.viewSelector.introLabel=Choisissez un espace de travail à ouvrir : 
dialog.viewSelector.noSelectionMsg=Vous devez s\u00E9lectionner un espace de travail.
dialog.viewSelector.ok=\ \ \ \ \ \ OK\ \ \ \ \ \ 
dialog.viewSelector.selectionCancelled=La s\u00E9lection a \u00E9t\u00E9 annul\u00E9e
dialog.viewSelector.selectionFailed=Echec de la s\u00E9lection de l'espace de travail
dialog.viewSelector.title=S\u00E9lection d'un espace de travail

# Those properties are not used in the com.nextep.designer.vsc.ui package
# TODO [BGA]: Check if those properties are used and if they should be moved to another properties file
deleteCheckException=Un probl\u00E8me est survenu lors de la verification des pr\u00E9-requis \u00E0 la suppression de cet \u00E9l\u00E9ment. Cela peut \u00EAtre d\u00FB \u00E0 des jobs d'arri\u00E8re-plan s'ex\u00E9cutant au m\u00EAme moment. Attendez quelques secondes puis r\u00E9essayez. Si le probl\u00E8me persiste, contactez neXtep Softwares.
cancelRemovalInfo=La suppression a \u00E9t\u00E9 annul\u00E9e.
compareWithSelection=Comparer avec la version s\u00E9lectionn\u00E9e
closingCurrentView=Fermeture de la vue courante...
editor.comparison.currentElementTag=El\u00E9ment courant : {0}
editor.comparison.databaseElementTag=Base de donn\u00E9es : {0}
editor.versionInfo.branch=Branche : 
editor.versionInfo.iteration=It\u00E9ration
editor.versionInfo.major=Majeure
editor.versionInfo.minor=Mineure
editor.versionInfo.newBranch=Nouvelle
editor.versionInfo.patch=Patch
editor.versionInfo.release=Version : 
editor.versionInfo.releaseType=Type : 
editor.versionInfo.revision=Rev
service.ui.dependencies.computationJobName=Calcul des d\u00E9pendances...
service.ui.dependencies.computationTaskName=Construction de la carte des d\u00E9pendances
service.ui.view.closeEditorsTask=Fermeture des \u00E9diteurs
service.ui.view.dependencyProblemMarker=Cet \u00E9l\u00E9ment d\u00E9pend des \u00E9l\u00E9ments \u00E0 supprimer
service.ui.view.loadView=Chargement de la vue depuis le référentiel...
service.ui.view.removeJob=Suppression des \u00E9l\u00E9ments...
service.ui.view.removeTask=Suppression des \u00E9l\u00E9ments...
showVersionHistory=Voir l'historique des versions
repositoryVersionUpgrade=La version du client neXtep designer n\u00E9cessite une mise \u00E0 jour du repository. Voulez-vous effectuer la mise \u00E0 jour du repository maintenant ?\n(Tous les utilisateurs de ce repository devront \u00E9ventuellement mettre \u00E0 jour leur client)
repositoryVersionUpgradeTitle=La version du repository est trop ancienne !
unknownContainerError=Impossible de retrouver le parent de l''{0} que vous tentez de cr\u00E9er dans la vue actuelle. Vous \u00EAtes probablement en train d''essayer de cr\u00E9er un \u00E9l\u00E9ment d\u00E9pendant d''un objet qui n''est pas encore cr\u00E9\u00E9, ce qui n''est pas autoris\u00E9.
unknownContainerErrorTitle=Veuillez d'abord finir la cr\u00E9ation du parent

page.lockedByUserMsg=Verrouillé par {0}
preferences.versioning.defaultIncrement=Incr\u00E9ment de version par d\u00E9faut :
preferences.versioning.description=Les pr\u00E9f\u00E9rences suivantes vous permettent d'ajuster le comportement du controle de version
preferences.versioning.iteration=It\u00E9ration
preferences.versioning.major=Majeure
preferences.versioning.minor=Mineure
preferences.versioning.noValidationText=Aucune validation
preferences.versioning.patch=Patch
preferences.versioning.validationIntro=Configurez les actions sur lesquelles vous souhaitez effectuer une validation (à utiliser avec précaution) :
preferences.versioning.promptForValidationText=Demander confirmation et ajustements
preferences.versioning.title=Pr\u00E9f\u00E9rences du controle de version
preferences.versioning.validationLabel=Validation sur {0} : 
properties.view.propertyCol=Propri\u00E9t\u00E9
properties.view.sourceValueCol=Source
properties.view.targetValueCol=Cible
provider.versionable.refreshJob=Mise à jour du navigateur de versions...
provider.versionable.refreshProblem=Impossible de rafraichir l''élément : {0}

navigator.filter=Filtre : 
wizard.workspace.connectionError=Erreur \u00E0 la cr\u00E9ation d'une connexion utilisateur
wizard.workspace.title=Assistant de cr\u00E9ation d'un espace de travail

editor.container.title=Détails du module de base de données
editor.container.description=Cette section détaille la définition d'un module de base de données.
editor.container.name=Nom : 
editor.container.shortName=Nom court : 
editor.container.desc=Description : 
editor.container.vendor=Vendeur : 
editor.container.schema=Schéma : 