###############################################################################
# Copyright (c) 2011 neXtep Software and contributors.
# All rights reserved.
#
# This file is part of neXtep designer.
#
# NeXtep designer is free software: you can redistribute it 
# and/or modify it under the terms of the GNU General Public 
# License as published by the Free Software Foundation, either 
# version 3 of the License, or any later version.
#
# NeXtep designer is distributed in the hope that it will be 
# useful, but WITHOUT ANY WARRANTY; without even the implied
# warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  
# See the GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Foobar.  If not, see <http://www.gnu.org/licenses/>.
#
# Contributors:
#     neXtep Softwares - initial API and implementation
###############################################################################
editor.mixedSql.sqlIntroText=Définissez le source SQL ci-dessous :
search.dialog.regExp=Expression régulière
search.dialog.textSearchLabel=Texte à chercher dans le SQL : 
search.dialog.wholeWord=Mot entier
sqlHover.columnNameCol=Colonne
sqlHover.datatypeCol=Type de données
sqlHover.dependencies=Eléments dépendants :
sqlHover.dependenciesJob=Calcul des dépendances pour le hover SQL
sqlHover.dependenciesJobError=Problème lors du calcul des dépendances du hover SQL: 
sqlHover.dependentOf=Dépendant de :
sqlHover.descriptionCol=Description
sqlHover.noDesc=Aucune description disponible.
submitSQL=Soumettre à la base de données cible
dbToReposSynchDesc=Cette section liste les mises à jour effectuées sur la base cible. Cochez les éléments que vous souhaitez mettre à jour (check out) dans le repository.
syncDeletionTitle=Eléments n'existant plus dans la base cible
syncDeletionDesc=Cette section liste les éléments n'existants plus dans la base cible. Les éléments cochés seront supprimés de leur container.
targetSynched=La base cible est synchronisée avec le repository.
synchronizationFiltersHelp=Les filtres de synchronisation vous permettent de définir des expressions régulières qui seront calculées durant la synchronisation pour ignorer certains éléments de votre base cible. Cela peut être utile si vous avez des éléments générés dynamiquement.
synchronizationFiltersAdd=Ajouter un nouveau filtre
synchronizationFiltersRemove=Supprimer le filtre sélectionné
syncUpdatesTitle=Eléments à mettre à jour
targetTypeNotDefault=Vous avez sélectionné une base de données de {0} comme cible de la synchronisation mais votre paramétrage actuel indiquent que vous souhaitez synchroniser vers des bases de données de {1}. Si vous soumettez le script résultant vous risquez d''altérer cette base de données.\nÊtes-vous sûr de vouloir effectuer cette synchronisation ?
targetTypeNotDefaultTitle=Base de données de {0} sélectionnée !
submitionDefaultJdbc=Aucun programme client dédié n'a pu être trouvé / configuré pour ce vendeur de base de données, votre SQL sera soumis via le client JDBC intégré à neXtep. Nous vous conseillons de définir l'emplacement du client SQL binaire de votre vendeur dans les préférences de génération.\nVoulez-vous continuer ?
submitionDefaultJdbcTitle=Utilisation du client JDBC par défaut
submitionToggle=Ne plus m'alerter sur ceci à l'avenir

dialog.synchUnpreferredSubmitter=L'utilisateur a annulé la génération.

annotation.job.name=Annotation du code source...

comparisonProvider.label.sql=Comparaison des sources SQL
editor.script.desc=Description : 
editor.script.name=Nom : 
editor.sql.breakpointText=Point d'arret ligne  
editor.sql.modelSwitchError=Impossible de mettre a jour cet \u00E9diteur, essayez de fermez / rouvrir cet \u00E9diteur : 
editor.sql.saveAsSqlFilePrompt=S\u00E9lectionnez le fichier vers lequel sauvegarder le source SQL
rename.package.confirmMsg=Le package en cours d'\u00E9dition a \u00E9t\u00E9 renomm\u00E9 depuis le source SQL, \u00EAtes-vous s\u00FBr de vouloir renommer ce package ?
rename.package.confirmTitle=Confirmation du renommage
rename.proc.confirmMsg=La proc\u00E9dure ou fonction en cours d'\u00E9dition a \u00E9t\u00E9 renomm\u00E9e depuis le source SQL, \u00EAtes-vous s\u00FBr de vouloir renommer cette proc\u00E9dure ou fonction ?
rename.proc.confirmTitle=Confirmation du renommage

wizard.crossgeneration.title=G\u00E9n\u00E9ration SQL pour un autre fournisseur
wizard.crossgeneration.version=S\u00E9lection de la version initiale
wizard.crossgeneration.version.desc=S\u00E9lectionnez la version initiale \u00e0 partir de laquelle le delta SQL sera g\u00E9n\u00E9r\u00E9 

# Those properties are not used anywhere
submitionStopped=Le processus client a été killé par l'utilisateur, il se peut que la synchronisation soit incomplète.
